In [15]:
import pandas as pd
import numpy as np

In [ ]:
df_cities = pd.read_csv('../data/city_attributes.csv')
df_cities

                 City        Country   Latitude   Longitude
0           Vancouver         Canada  49.249660 -123.119339
1            Portland  United States  45.523449 -122.676208
2       San Francisco  United States  37.774929 -122.419418
3             Seattle  United States  47.606209 -122.332069
4         Los Angeles  United States  34.052231 -118.243683
5           San Diego  United States  32.715328 -117.157257
6           Las Vegas  United States  36.174969 -115.137222
7             Phoenix  United States  33.448380 -112.074043
8         Albuquerque  United States  35.084492 -106.651138
9              Denver  United States  39.739151 -104.984703
10        San Antonio  United States  29.424120  -98.493629
11             Dallas  United States  32.783058  -96.806671
12            Houston  United States  29.763281  -95.363274
13        Kansas City  United States  39.099731  -94.578568
14        Minneapolis  United States  44.979969  -93.263840
15        Saint Louis  United States  38.627270  -90.197891
16            Chicago  United States  41.850029  -87.650047
17          Nashville  United States  36.165890  -86.784439
18       Indianapolis  United States  39.768379  -86.158043
19            Atlanta  United States  33.749001  -84.387978
20            Detroit  United States  42.331429  -83.045753
21       Jacksonville  United States  30.332180  -81.655647
22          Charlotte  United States  35.227089  -80.843132
23              Miami  United States  25.774269  -80.193657
24         Pittsburgh  United States  40.440620  -79.995888
25            Toronto         Canada  43.700111  -79.416298
26       Philadelphia  United States  39.952339  -75.163788
27           New York  United States  40.714272  -74.005966
28           Montreal         Canada  45.508839  -73.587807
29             Boston  United States  42.358429  -71.059769
30          Beersheba         Israel  31.251810   34.791302
31  Tel Aviv District         Israel  32.083328   34.799999
32              Eilat         Israel  29.558050   34.948212
33              Haifa         Israel  32.815559   34.989170
34          Nahariyya         Israel  33.005859   35.094090
35          Jerusalem         Israel  31.769039   35.216331

In [ ]:
df_humidity = pd.read_csv('../data/humidity.csv')
df_humidity = df_humidity.melt(
    id_vars=['datetime'],
    var_name='city',
    value_name='humidity'
)
df_humidity

                    datetime       city  humidity
0        2012-10-01 12:00:00  Vancouver       NaN
1        2012-10-01 13:00:00  Vancouver      76.0
2        2012-10-01 14:00:00  Vancouver      76.0
3        2012-10-01 15:00:00  Vancouver      76.0
4        2012-10-01 16:00:00  Vancouver      77.0
...                      ...        ...       ...
1629103  2017-11-29 20:00:00  Jerusalem       NaN
1629104  2017-11-29 21:00:00  Jerusalem       NaN
1629105  2017-11-29 22:00:00  Jerusalem       NaN
1629106  2017-11-29 23:00:00  Jerusalem       NaN
1629107  2017-11-30 00:00:00  Jerusalem       NaN

[1629108 rows x 3 columns]

In [ ]:
df_pressure = pd.read_csv('../data/pressure.csv')
df_pressure = df_pressure.melt(
    id_vars=['datetime'],
    var_name='city',
    value_name='pressure'
)
df_pressure

                    datetime       city  pressure
0        2012-10-01 12:00:00  Vancouver       NaN
1        2012-10-01 13:00:00  Vancouver       NaN
2        2012-10-01 14:00:00  Vancouver       NaN
3        2012-10-01 15:00:00  Vancouver       NaN
4        2012-10-01 16:00:00  Vancouver       NaN
...                      ...        ...       ...
1629103  2017-11-29 20:00:00  Jerusalem       NaN
1629104  2017-11-29 21:00:00  Jerusalem       NaN
1629105  2017-11-29 22:00:00  Jerusalem       NaN
1629106  2017-11-29 23:00:00  Jerusalem       NaN
1629107  2017-11-30 00:00:00  Jerusalem       NaN

[1629108 rows x 3 columns]

In [ ]:
df_temperature = pd.read_csv('../data/temperature.csv')
df_temperature = df_temperature.melt(
    id_vars=['datetime'],
    var_name='city',
    value_name='temperature'
)
df_temperature

                    datetime       city  temperature
0        2012-10-01 12:00:00  Vancouver          NaN
1        2012-10-01 13:00:00  Vancouver   284.630000
2        2012-10-01 14:00:00  Vancouver   284.629041
3        2012-10-01 15:00:00  Vancouver   284.626998
4        2012-10-01 16:00:00  Vancouver   284.624955
...                      ...        ...          ...
1629103  2017-11-29 20:00:00  Jerusalem          NaN
1629104  2017-11-29 21:00:00  Jerusalem          NaN
1629105  2017-11-29 22:00:00  Jerusalem          NaN
1629106  2017-11-29 23:00:00  Jerusalem          NaN
1629107  2017-11-30 00:00:00  Jerusalem          NaN

[1629108 rows x 3 columns]

In [ ]:
df_description = pd.read_csv('../data/weather_description.csv')
df_description = df_description.melt(
    id_vars=['datetime'],
    var_name='city',
    value_name='description'
)
df_description

                    datetime       city    description
0        2012-10-01 12:00:00  Vancouver            NaN
1        2012-10-01 13:00:00  Vancouver           mist
2        2012-10-01 14:00:00  Vancouver  broken clouds
3        2012-10-01 15:00:00  Vancouver  broken clouds
4        2012-10-01 16:00:00  Vancouver  broken clouds
...                      ...        ...            ...
1629103  2017-11-29 20:00:00  Jerusalem            NaN
1629104  2017-11-29 21:00:00  Jerusalem            NaN
1629105  2017-11-29 22:00:00  Jerusalem            NaN
1629106  2017-11-29 23:00:00  Jerusalem            NaN
1629107  2017-11-30 00:00:00  Jerusalem            NaN

[1629108 rows x 3 columns]

In [ ]:
df_winddir = pd.read_csv('../data/wind_direction.csv')
df_winddir = df_winddir.melt(
    id_vars=['datetime'],
    var_name='city',
    value_name='wind_dir'
)
df_winddir

                    datetime       city  wind_dir
0        2012-10-01 12:00:00  Vancouver       NaN
1        2012-10-01 13:00:00  Vancouver       0.0
2        2012-10-01 14:00:00  Vancouver       6.0
3        2012-10-01 15:00:00  Vancouver      20.0
4        2012-10-01 16:00:00  Vancouver      34.0
...                      ...        ...       ...
1629103  2017-11-29 20:00:00  Jerusalem       NaN
1629104  2017-11-29 21:00:00  Jerusalem       NaN
1629105  2017-11-29 22:00:00  Jerusalem       NaN
1629106  2017-11-29 23:00:00  Jerusalem       NaN
1629107  2017-11-30 00:00:00  Jerusalem       NaN

[1629108 rows x 3 columns]

In [ ]:
df_windsp = pd.read_csv('../data/wind_speed.csv')
df_windsp = df_windsp.melt(
    id_vars=['datetime'],
    var_name='city',
    value_name='wind_sp'
)
df_windsp

                    datetime       city  wind_sp
0        2012-10-01 12:00:00  Vancouver      NaN
1        2012-10-01 13:00:00  Vancouver      0.0
2        2012-10-01 14:00:00  Vancouver      0.0
3        2012-10-01 15:00:00  Vancouver      0.0
4        2012-10-01 16:00:00  Vancouver      0.0
...                      ...        ...      ...
1629103  2017-11-29 20:00:00  Jerusalem      NaN
1629104  2017-11-29 21:00:00  Jerusalem      NaN
1629105  2017-11-29 22:00:00  Jerusalem      NaN
1629106  2017-11-29 23:00:00  Jerusalem      NaN
1629107  2017-11-30 00:00:00  Jerusalem      NaN

[1629108 rows x 3 columns]

In [23]:
metrics = [df_description, df_humidity, df_pressure, df_temperature, df_winddir, df_windsp]

df = metrics[0]

for df_to_merge in metrics[1:]:
    df = df.merge(df_to_merge, on=['datetime', 'city'], how='outer')

In [24]:
df

,datetime,city,description,humidity,pressure,temperature,wind_dir,wind_sp
0,2012-10-01 12:00:00,Albuquerque,NaN,NaN,NaN,NaN,NaN,NaN
1,2012-10-01 12:00:00,Atlanta,NaN,NaN,NaN,NaN,NaN,NaN
2,2012-10-01 12:00:00,Beersheba,NaN,NaN,NaN,NaN,NaN,NaN
3,2012-10-01 12:00:00,Boston,NaN,NaN,NaN,NaN,NaN,NaN
4,2012-10-01 12:00:00,Charlotte,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
1629103,2017-11-30 00:00:00,San Francisco,NaN,NaN,NaN,NaN,NaN,NaN
1629104,2017-11-30 00:00:00,Seattle,few clouds,75.0,1028.0,283.04,100.0,4.0
1629105,2017-11-30 00:00:00,Tel Aviv District,NaN,NaN,NaN,NaN,NaN,NaN
1629106,2017-11-30 00:00:00,Toronto,sky is clear,60.0,1027.0,274.51,330.0,3.0
1629107,2017-11-30 00:00:00,Vancouver,NaN,NaN,NaN,NaN,NaN,NaN

In [25]:
df = df.merge(
    df_cities,
    left_on='city',
    right_on='City',
    how='outer'
)
df = df.drop('City', axis=1)

In [ ]:
df.to_csv('../data/combined.csv')